#include <stdio.h>

int main() { // 메인함수
   // 변수
   // DataType 변수명;
    int score;   // 4byte짜리 정수 저장공간을 할당해줘
             // 그 공간의 이름을 score라고 하겠어
             // 명령의 끝에는 반드시 ;(세미콜론)을 표기해야 합니다.
             // 명령의 끝에는 반드시 ;(세미콜론)을 표기해야 합니다.

    // 변수이름은 영대소문자, 숫자, _
    // 숫자는 첫글자로 사용할 수 없습니다.

    int 2score;   // 변수명 앞에 숫자를 첫글자로 사용할 수 없습니다.
    int s2core;   // 숫자는 항상 문자 다음에 쓸수 있습니다.

    // 변수명은 저장되어지는 값을 나타내는 단어나 문장으로 
    // 만드시는 것이 좋습니다.

    // 변수명의 길이는 표준 C에서는 31문자, Visual Studio 128문자 가능

    // 주석 설명을 기재. 코드에 포함 되지 않습니다.
     // 한줄 주석
    /*
      블럭 주석 (여러 줄의 주석을 쓸때)
    */

}